ToolOpenFoamExample3/system/setFieldsDict
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      setFieldsDict;
}

//The default kinematic pressure is zero
defaultFieldValues
(
  volScalarFieldValue alpha1 0
);

//Create one special region  
regions
(
  //The region has the shape of a box, in this case a cube
  boxToCell
  {
    box (0.45 0.45 0.45) (0.55 0.55 0.55);

    //The kinematic pressure within the box is one
    fieldValues
    (
      volScalarFieldValue alpha1 1
    );
  }
);
   